Catalogs/Подразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Подразделения</Name>
			<Comment>(Упр)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WWW</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сви_СхемаОбменаССайтом</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сви_СхемыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаТурбоСМС_СД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТурбоСМС_НастройкиПодулючения_СД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка_WayforpayСД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.wayforpay_НастройкиПодключения_СД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС_ПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОтправкиСМС_СД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникБанковскойВыписки</Name>
					<Comment>Какой банковский API опрашивать при загрузке выписки по этому подразделению.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиБанковскихВыписок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенБанковскойВыписки</Name>
					<Comment>token из Приват24 Бизнес либо X-Token Monobank.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АйдиБанковскойВыписки</Name>
					<Comment>id клиента для Приват24 Бизнес либо id счёта/карты для Monobank.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьБанковскуюВыписку</Name>
					<Comment>Включает подразделение в регламентную загрузку выписок.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеОперацийВыписки</Name>
					<Comment>Какие операции загружать: только входящие, только исходящие или все. Пустое значение = все.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НаправлениеБанковскихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетВыписки</Name>
					<Comment>Счет организации, который обслуживает этот API. Подставляется в СчетОрганизации создаваемых платежных документов.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЗагрузкиВыписки</Name>
					<Comment>Операции раньше этой даты в выписку не берутся. Пусто — ограничения нет.</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Производители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Диаметр</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сезон</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Сезонность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоставщикиБренд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БП_СкидкиПоУсловиямПоставок</Name>
					<Comment>//+БП: d.matyash (16.09.2024) &lt;&gt;</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФормыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ФормыРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПодразделений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОрганизацииПоСумме</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СенсорныйЕкран_Оплата_СД/Ext/Module.bsl
// Оплата заказа с сенсорного экрана.
//
// Обвязка над Wayforpay_ОбщийМодуль_СД и менеджером ПлатежногоПорученияВходящего.
// Диалогов здесь нет намеренно: с оператором общается форма, модуль только читает
// и пишет данные и возвращает структуру с текстом для показа.
//
// Та же логика в форме документа ЗаказПокупателя (ПолучитьОплатуWayForPay);
// при правках держать обе стороны в согласии.

////////////////////////////////////////////////////////////////////////////////
// Данные заказа для формы оплаты

// Всё, что форме нужно показать по заказу. Пустая структура (Заказ не заполнен)
// возвращается с признаком Успешно = Ложь.
Функция ДанныеОплаты(ЗаказСсылка) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("Номер", "");
	Результат.Вставить("Дата", '00010101');
	Результат.Вставить("Контрагент", "");
	Результат.Вставить("СуммаДокумента", 0);
	Результат.Вставить("СуммаПредоплаты", 0);
	Результат.Вставить("Подразделение", Справочники.Подразделения.ПустаяСсылка());
	Результат.Вставить("ЕстьНастройкаWayforpay", Ложь);
	Результат.Вставить("ЕстьНастройкаСМС", Ложь);
	Результат.Вставить("URLИнвойса", "");
	Результат.Вставить("URLИнвойсаПредоплата", "");
	Результат.Вставить("Телефон", "");
	Результат.Вставить("ТекстСМС", "");
	Результат.Вставить("idСМС", "");
	Результат.Вставить("СтатусСМС", "");
	Результат.Вставить("ФормаРасчета", Справочники.ФормыРасчета.ПустаяСсылка());

	Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
		Результат.Сообщение = "Замовлення не передано.";
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно                = Истина;
	Результат.Номер                  = СокрЛП(ЗаказСсылка.Номер);
	Результат.Дата                   = ЗаказСсылка.Дата;
	Результат.Контрагент             = Строка(ЗаказСсылка.Контрагент);
	Результат.СуммаДокумента         = ЗаказСсылка.СуммаДокумента;
	Результат.СуммаПредоплаты        = ЗаказСсылка.НП_ОплатаНаКарту;
	Результат.Подразделение          = ЗаказСсылка.Подразделение;
	Результат.URLИнвойса             = СокрЛП(ЗаказСсылка.Wayforpay_url_INVOICE);
	Результат.URLИнвойсаПредоплата   = СокрЛП(ЗаказСсылка.Wayforpay_url_INVOICE_предоплата);
	Результат.idСМС                  = СокрЛП(ЗаказСсылка.id_СМС_СД);
	Результат.СтатусСМС              = СокрЛП(Строка(ЗаказСсылка.Статус_СМС));
	Результат.ФормаРасчета           = ЗаказСсылка.ФормаРасчета;
	Результат.Телефон                = ТелефонДляСМС(ЗаказСсылка);
	Результат.ТекстСМС               = ТекстСМС(ЗаказСсылка);

	Если ЗначениеЗаполнено(ЗаказСсылка.Подразделение) Тогда
		Результат.ЕстьНастройкаWayforpay =
			ЗначениеЗаполнено(ЗаказСсылка.Подразделение.Настройка_WayforpayСД);
		Результат.ЕстьНастройкаСМС =
			ЗначениеЗаполнено(ЗаказСсылка.Подразделение.НастройкаТурбоСМС_СД);
	КонецЕсли;

	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Форма расчёта

// Формы расчёта, доступные подразделению оператора.
//
// Привязка живёт в табличной части СписокПодразделений — своего реквизита
// Подразделение у справочника нет. Элементы с пустым списком считаем общими:
// иначе у подразделения, которому ничего не назначено, выбора не будет вовсе.
// Форма расчёта для безнала, выбранная в этом подразделении в прошлый раз.
//
// Лежит в хранилище общих настроек, а не в реквизите: своих полей под это в
// метаданных нет, а спрашивать оператора на каждом заказе — то же самое, что
// не спрашивать вовсе, только дольше.
Функция ЗапомненнаяФормаРасчета(Подразделение) Экспорт

	Попытка
		Возврат ХранилищеОбщихНастроек.Загрузить(КлючХранилища(), КлючНастроекПодразделения(Подразделение));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Процедура ЗапомнитьФормуРасчета(Подразделение, ФормаРасчета) Экспорт

	// Не смогли сохранить (нет права на настройки) — не беда: в следующий раз
	// просто спросим ещё раз.
	Попытка
		ХранилищеОбщихНастроек.Сохранить(КлючХранилища(), КлючНастроекПодразделения(Подразделение), ФормаРасчета);
	Исключение
	КонецПопытки;

КонецПроцедуры

Функция КлючХранилища()

	Возврат "СенсорныйЕкран_Оплата_СД";

КонецФункции

Функция КлючНастроекПодразделения(Подразделение)

	Если ЗначениеЗаполнено(Подразделение) Тогда
		Возврат "ФормаРасчетаБезнал_" + Строка(Подразделение.УникальныйИдентификатор());
	КонецЕсли;

	Возврат "ФормаРасчетаБезнал_Общая";

КонецФункции

Функция ФормыРасчетаПодразделения(Подразделение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ФормыРасчета.Ссылка КАК Ссылка,
		|	ФормыРасчета.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ФормыРасчета КАК ФормыРасчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФормыРасчета.СписокПодразделений КАК ПодразделенияФормы
		|		ПО ФормыРасчета.Ссылка = ПодразделенияФормы.Ссылка
		|ГДЕ
		|	НЕ ФормыРасчета.ПометкаУдаления
		|	И (&ПодразделениеНеЗадано
		|		ИЛИ ПодразделенияФормы.Подразделение = &Подразделение
		|		ИЛИ ПодразделенияФормы.Подразделение ЕСТЬ NULL)
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";

	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПодразделениеНеЗадано", Не ЗначениеЗаполнено(Подразделение));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Записать заказ с новой формой расчёта.
//
// Форма расчёта тянет за собой организацию (ИзменитьОрганизацию), а организация —
// префикс нумерации, поэтому после записи номер заказа меняется. Инвойс строится
// из номера, значит выставлять его можно только после этой записи.
Функция УстановитьФормуРасчета(ЗаказСсылка, ФормаРасчета) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("Номер", "");

	Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
		Результат.Сообщение = "Замовлення не передано.";
		Возврат Результат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ФормаРасчета) Тогда
		Результат.Сообщение = "Не вказана форма розрахунку.";
		Возврат Результат;
	КонецЕсли;

	Попытка

		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();

		Если ЗаказОбъект.ФормаРасчета = ФормаРасчета Тогда
			Результат.Успешно = Истина;
			Результат.Номер = СокрЛП(ЗаказОбъект.Номер);
			Возврат Результат;
		КонецЕсли;

		ЗаказОбъект.ФормаРасчета = ФормаРасчета;
		БП_ОбщийМодуль.ИзменитьОрганизацию(ЗаказОбъект, Ложь, Истина, Истина);

		// Номер выдан под прежнюю организацию. Типовая процедура чистит его только
		// если префикс перестал совпадать; пустой номер платформа выдаст заново
		// при записи. Так же это делает форма заказа.
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЗаказОбъект, "Номер");

		ЗаказОбъект.Записать();

		Результат.Успешно = Истина;
		Результат.Номер = СокрЛП(ЗаказОбъект.Номер);

	Исключение
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Инвойс WayForPay

Функция СоздатьИнвойс(ЗаказСсылка, Предоплата = Ложь, Сумма = 0) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("URLИнвойса", "");

	НастройкаWayforpay = НастройкаWayforpay(ЗаказСсылка);
	Если Не ЗначениеЗаполнено(НастройкаWayforpay) Тогда
		Результат.Сообщение = "У підрозділі не вказано налаштування Wayforpay.";
		Возврат Результат;
	КонецЕсли;

	СуммаИнвойса = ?(Сумма = 0, ЗаказСсылка.СуммаДокумента, Сумма);
	Если СуммаИнвойса <= 0 Тогда
		Результат.Сообщение = "Сума оплати не вказана.";
		Возврат Результат;
	КонецЕсли;

	Попытка

		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();

		НомерИнвойса = ЗаказОбъект.КоличествоИнвойсов_Wayforpay + 1;
		OrderReference = СокрЛП(ЗаказОбъект.Номер) + "_" + Строка(НомерИнвойса);

		Если Предоплата Тогда
			ЗаказОбъект.НП_ОплатаНаКарту = СуммаИнвойса;
		КонецЕсли;

		Рез = Wayforpay_ОбщийМодуль_СД.СоздатьИнвойс(
			НастройкаWayforpay,
			ЗаказОбъект,
			OrderReference,
			СуммаИнвойса,
			Предоплата);

		// Счётчик растёт и на неудаче — так делает форма заказа: номер, ушедший
		// в WayForPay, повторно использовать нельзя, даже если ответ не дошёл.
		ЗаказОбъект.КоличествоИнвойсов_Wayforpay = НомерИнвойса;

		Если Рез.Успешно Тогда

			Если Предоплата Тогда
				ЗаказОбъект.Wayforpay_url_INVOICE_предоплата = Рез.invoiceUrl;
				ЗаказОбъект.НомерИнвойсПредоплата_Wayforpay = НомерИнвойса;
			Иначе
				ЗаказОбъект.Wayforpay_url_INVOICE = Рез.invoiceUrl;
				ЗаказОбъект.НомерИнвойсПолнаяОплата_Wayforpay = НомерИнвойса;
			КонецЕсли;

			Результат.Успешно = Истина;
			Результат.URLИнвойса = Рез.invoiceUrl;

		Иначе
			Результат.Сообщение = "Не вдалося сформувати інвойс. " + Рез.Сообщение;
		КонецЕсли;

		ЗаказОбъект.Записать();

	Исключение
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция УдалитьИнвойс(ЗаказСсылка, Предоплата = Ложь) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");

	НастройкаWayforpay = НастройкаWayforpay(ЗаказСсылка);
	Если Не ЗначениеЗаполнено(НастройкаWayforpay) Тогда
		Результат.Сообщение = "У підрозділі не вказано налаштування Wayforpay.";
		Возврат Результат;
	КонецЕсли;

	URLИнвойса = ?(Предоплата,
		СокрЛП(ЗаказСсылка.Wayforpay_url_INVOICE_предоплата),
		СокрЛП(ЗаказСсылка.Wayforpay_url_INVOICE));

	Если ПустаяСтрока(URLИнвойса) Тогда
		Результат.Сообщение = "Інвойс не створено.";
		Возврат Результат;
	КонецЕсли;

	Попытка

		ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();

		OrderReference = OrderReferenceИнвойса(ЗаказСсылка, НомерИнвойса(ЗаказСсылка, Предоплата));

		Рез = Wayforpay_ОбщийМодуль_СД.УдалитьИнвойс(
			НастройкаWayforpay,
			ЗаказОбъект,
			OrderReference);

		Если Рез.Успешно Тогда

			Если Предоплата Тогда
				ЗаказОбъект.Wayforpay_url_INVOICE_предоплата = "";
			Иначе
				ЗаказОбъект.Wayforpay_url_INVOICE = "";
			КонецЕсли;

			ЗаказОбъект.Записать();

			Результат.Успешно = Истина;
			Результат.Сообщение = "Інвойс видалено.";

		Иначе
			Результат.Сообщение = "Не вдалося видалити інвойс. " + Рез.Сообщение;
		КонецЕсли;

	Исключение
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Спросить статус оплаты и, если деньги пришли, завести платёжное поручение.
//
// Статус спрашивается по всем инвойсам заказа, а не только по последнему:
// клиент мог оплатить первый, пока оператор выставлял второй.
Функция ПолучитьОплату(ЗаказСсылка, Предоплата = Ложь) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("СтатусОплаты", "");
	Результат.Вставить("КодОтвета", 0);
	Результат.Вставить("Оплачено", Ложь);
	Результат.Вставить("СсылкаППВ", Неопределено);
	Результат.Вставить("ППВСоздано", Ложь);
	Результат.Вставить("ППВСуществовало", Ложь);

	НастройкаWayforpay = НастройкаWayforpay(ЗаказСсылка);
	Если Не ЗначениеЗаполнено(НастройкаWayforpay) Тогда
		Результат.Сообщение = "У підрозділі не вказано налаштування Wayforpay.";
		Возврат Результат;
	КонецЕсли;

	URLИнвойса = ?(Предоплата,
		СокрЛП(ЗаказСсылка.Wayforpay_url_INVOICE_предоплата),
		СокрЛП(ЗаказСсылка.Wayforpay_url_INVOICE));

	Если ПустаяСтрока(URLИнвойса) Тогда
		Результат.Сообщение = "Інвойс не створено.";
		Возврат Результат;
	КонецЕсли;

	Рез = Неопределено;

	Для Каждого OrderReference Из OrderReferenceКандидаты(ЗаказСсылка, НомерИнвойса(ЗаказСсылка, Предоплата)) Цикл

		Ответ = Wayforpay_ОбщийМодуль_СД.ПолучитьСтатусИнвойса(НастройкаWayforpay, OrderReference);

		Если Рез = Неопределено Или (Ответ.Успешно И Не Рез.Успешно) Тогда
			Рез = Ответ;
		КонецЕсли;

		Если Ответ.Успешно И Ответ.СтатусОплаты = "Approved" Тогда
			Рез = Ответ;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Если Рез = Неопределено Тогда
		Результат.Сообщение = "Не визначено номер інвойсу замовлення.";
		Возврат Результат;
	КонецЕсли;

	Если Рез.Свойство("КодОтвета") Тогда
		Результат.КодОтвета = Рез.КодОтвета;
	КонецЕсли;

	Если Рез.Свойство("СтатусОплаты") Тогда
		Результат.СтатусОплаты = Рез.СтатусОплаты;
	КонецЕсли;

	Если Не Рез.Успешно Тогда
		Результат.Сообщение = "Не вдалося отримати статус оплати. " + Рез.Сообщение;
		Возврат Результат;
	КонецЕсли;

	Если Рез.СтатусОплаты <> "Approved" Тогда
		Результат.Успешно = Истина;
		Результат.Сообщение = "Інвойс не оплачено. Статус: " + Рез.СтатусОплаты;
		Возврат Результат;
	КонецЕсли;

	Результат.Оплачено = Истина;

	// Деньги пришли. Сначала ищем уже заведённое ППВ — иначе на повторное
	// нажатие «Перевірити статус» создастся второй платёж на ту же сумму.
	СсылкаППВ = НайтиПлатеж(ЗаказСсылка, Рез);

	Если ЗначениеЗаполнено(СсылкаППВ) Тогда
		Результат.Успешно = Истина;
		Результат.СсылкаППВ = СсылкаППВ;
		Результат.ППВСуществовало = Истина;
		Результат.Сообщение = "Оплачено. Платіжне доручення вже створено: " + Строка(СсылкаППВ);
		Возврат Результат;
	КонецЕсли;

	РезультатСоздания = Документы.ПлатежноеПоручениеВходящее.СоздатьПлатежноеПоручениеWayForPay(
		ЗаказСсылка,
		Рез,
		ДатаПлатежа(Рез));

	Если Не РезультатСоздания.Успешно Тогда
		Результат.Сообщение = "Оплачено, але не вдалося створити платіжне доручення. "
			+ РезультатСоздания.Сообщение;
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Истина;
	Результат.ППВСоздано = Истина;

	Если РезультатСоздания.Свойство("Ссылка") Тогда
		Результат.СсылкаППВ = РезультатСоздания.Ссылка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Результат.СсылкаППВ) Тогда
		Результат.СсылкаППВ = НайтиПлатеж(ЗаказСсылка, Рез);
	КонецЕсли;

	Результат.Сообщение = "Оплачено. Платіжне доручення створено";
	Если ЗначениеЗаполнено(Результат.СсылкаППВ) Тогда
		Результат.Сообщение = Результат.Сообщение + ": " + Строка(Результат.СсылкаППВ);
	КонецЕсли;

	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// QR

// PNG с QR-кодом ссылки на оплату, положенный во временное хранилище формы.
// Картинку рисует тот же механизм, что и QR НБУ (менеджер БанковскихСчетов).
Функция АдресКартинкиQR(СтрокаДляQR, УникальныйИдентификаторФормы, Размер = "400x400") Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("Адрес", "");

	Если ПустаяСтрока(СокрЛП(СтрокаДляQR)) Тогда
		Результат.Сообщение = "Інвойс не створено, немає що показувати.";
		Возврат Результат;
	КонецЕсли;

	ДвоичныеДанные = Справочники.БанковскиеСчета.NBU_QR_ПолучитьPNGПоСтроке(
		СокрЛП(СтрокаДляQR),
		Размер);

	Если ДвоичныеДанные = Неопределено Тогда
		Результат.Сообщение = "Не вдалося отримати QR-код. Перевірте інтернет на терміналі.";
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Истина;
	Результат.Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФормы);

	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СМС

Функция ОтправитьСМС(ЗаказСсылка, Телефон, Текст) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("idСМС", "");

	Если Не ЗначениеЗаполнено(ЗаказСсылка.Подразделение)
		Или Не ЗначениеЗаполнено(ЗаказСсылка.Подразделение.НастройкаТурбоСМС_СД) Тогда

		Результат.Сообщение = "У підрозділі не вказано налаштування відправки SMS.";
		Возврат Результат;
	КонецЕсли;

	ТелефонПолучателя = НормализоватьТелефон(Телефон);

	Если СтрДлина(ТелефонПолучателя) <> 12 Тогда
		Результат.Сообщение = "Невірно вказано номер телефону: " + СокрЛП(Строка(Телефон));
		Возврат Результат;
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(Текст)) Тогда
		Результат.Сообщение = "Текст SMS не заповнено.";
		Возврат Результат;
	КонецЕсли;

	Попытка

		Рез = ТурбоСМС_ОбщийМодуль_СД.ОтправитьСообщение(
			ЗаказСсылка.Подразделение.НастройкаТурбоСМС_СД,
			ТелефонПолучателя,
			Текст);

		Если Рез.Успешно Тогда

			ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
			ЗаказОбъект.id_СМС_СД = Рез.message_id;
			ЗаказОбъект.НП_ТелефонПолучателя = ТелефонПолучателя;
			ЗаказОбъект.ТекстДляОтправкиСМС = Текст;
			ЗаказОбъект.Записать();

			Результат.Успешно = Истина;
			Результат.idСМС = Рез.message_id;
			Результат.Сообщение = "SMS відправлено.";

		Иначе
			Результат.Сообщение = "Не вдалося відправити SMS. " + Рез.Сообщение;
		КонецЕсли;

	Исключение
		Результат.Сообщение = ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;

КонецФункции

Функция ТекстСМС(ЗаказСсылка) Экспорт

	Шаблон = ЗаказСсылка.ШаблонСМС;

	Если Не ЗначениеЗаполнено(Шаблон)
		И ЗначениеЗаполнено(ЗаказСсылка.Подразделение) Тогда

		Шаблон = ЗаказСсылка.Подразделение.ШаблонСМС_ПоУмолчанию;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Шаблон) Тогда
		Возврат СокрЛП(ЗаказСсылка.ТекстДляОтправкиСМС);
	КонецЕсли;

	Попытка
		Возврат ТурбоСМС_ОбщийМодуль_СД.ПолучитьТекстСМС(Шаблон, ЗаказСсылка);
	Исключение
		Возврат СокрЛП(ЗаказСсылка.ТекстДляОтправкиСМС);
	КонецПопытки;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные

Функция НастройкаWayforpay(ЗаказСсылка)

	Если Не ЗначениеЗаполнено(ЗаказСсылка) Или Не ЗначениеЗаполнено(ЗаказСсылка.Подразделение) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ЗаказСсылка.Подразделение.Настройка_WayforpayСД;

КонецФункции

Функция НомерИнвойса(ЗаказСсылка, Предоплата)

	Возврат ?(Предоплата,
		ЗаказСсылка.НомерИнвойсПредоплата_Wayforpay,
		ЗаказСсылка.НомерИнвойсПолнаяОплата_Wayforpay);

КонецФункции

Функция OrderReferenceИнвойса(ЗаказСсылка, НомерИнвойса)

	OrderReferenceПоНомеру = СокрЛП(ЗаказСсылка.Номер) + "_" + Строка(НомерИнвойса);

	Возврат Wayforpay_ОбщийМодуль_СД.OrderReferenceПоЗаказу(
		ЗаказСсылка,
		НомерИнвойса,
		OrderReferenceПоНомеру);

КонецФункции

Функция OrderReferenceКандидаты(ЗаказСсылка, НомерИнвойса)

	Кандидаты = Новый Массив;
	Кандидаты.Добавить(OrderReferenceИнвойса(ЗаказСсылка, НомерИнвойса));

	Для Каждого Значение Из Wayforpay_ОбщийМодуль_СД.OrderReferenceСписокПоЗаказу(ЗаказСсылка) Цикл
		Если Кандидаты.Найти(Значение) = Неопределено Тогда
			Кандидаты.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат Кандидаты;

КонецФункции

// processingDate приходит unix-временем.
Функция ДатаПлатежа(Рез)

	Если ЗначениеЗаполнено(Рез.ДатаОплаты) И Рез.ДатаОплаты <> 0 Тогда
		Возврат Дата(1970, 1, 1, 0, 0, 0) + Рез.ДатаОплаты + 3 * 60 * 60;
	КонецЕсли;

	Возврат ТекущаяДата();

КонецФункции

// Ищем обоими ключами: «заказ + AuthCode» и входящий номер (= orderReference).
// Одного AuthCode мало: платёж из банковской выписки несёт код своей транзакции.
Функция НайтиПлатеж(ЗаказСсылка, Рез)

	Платеж = Документы.ПлатежноеПоручениеВходящее.ОписаниеПлатежаПоЗаказу();

	Платеж.Сумма       = Рез.Сумма;
	Платеж.ДатаПлатежа = ДатаПлатежа(Рез);
	Платеж.AuthCode    = Рез.AuthCode;

	OrderReference = СокрЛП(Строка(Рез.НомерЗаказа));

	Если Не ПустаяСтрока(OrderReference) И СтрДлина(OrderReference) <= 30 Тогда
		Платеж.НомерВходящегоДокумента = OrderReference;
	КонецЕсли;

	Возврат Документы.ПлатежноеПоручениеВходящее.НайтиПлатежПоЗаказу(ЗаказСсылка, Платеж);

КонецФункции

Функция ТелефонДляСМС(ЗаказСсылка)

	Телефон = НормализоватьТелефон(ЗаказСсылка.НП_ТелефонПолучателя);

	Если СтрДлина(Телефон) <> 12 Тогда
		Телефон = НормализоватьТелефон(ЗаказСсылка.Телефон);
	КонецЕсли;

	Возврат Телефон;

КонецФункции

// «(067) 123-45-67», «067 123 45 67», «+380671234567» → «380671234567».
Функция НормализоватьТелефон(Знач Телефон) Экспорт

	Исходная = СокрЛП(Строка(Телефон));
	ТолькоЦифры = "";

	Для Номер = 1 По СтрДлина(Исходная) Цикл
		Символ = Сред(Исходная, Номер, 1);
		Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда
			ТолькоЦифры = ТолькоЦифры + Символ;
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(ТолькоЦифры) = 10 И Лев(ТолькоЦифры, 1) = "0" Тогда
		Возврат "38" + ТолькоЦифры;
	КонецЕсли;

	Если СтрДлина(ТолькоЦифры) = 9 Тогда
		Возврат "380" + ТолькоЦифры;
	КонецЕсли;

	Возврат ТолькоЦифры;

КонецФункции
